{
    "title": "IBM Cloud速 Databases for Elasticsearch docs",
    "lastupdated": "2023-11-14",
    "introduction": "Elasticsearch combines the power of a full text search engine with the indexing strengths of a JSON document database.",
    "section_devtools": {
      "api": "/apidocs/cloud-databases-api/cloud-databases-api-v5#introduction",
      "cli": "/docs/databases-cli-plugin",
      "terraform": "https://registry.terraform.io/providers/IBM-Cloud/ibm/latest/docs/resources/database"
    },
    "section_recommended": [
      {
        "title": "Getting Started",
        "description": "A brief tutorial to introduce using an IBM Cloud速 Databases for Elasticsearch deployment.",
        "href": "/docs/databases-for-elasticsearch?topic=databases-for-elasticsearch-getting-started"
      },
      {
        "title": "Setting the Admin Password",
        "description": "The Databases for Elasticsearch service is provisioned with an admin user. You must set the admin password before you use it to connect.",
        "href": "/docs/databases-for-elasticsearch?topic=databases-for-elasticsearch-user-management&interface=ui#user-management-set-admin-password-ui"
      },
      {
        "title": "Getting Connection Strings",
        "description": "To connect to IBM Cloud速 Databases for Elasticsearch, you need some users and connection strings. Connection Strings for your deployment are displayed on the Dashboard Overview, in the Endpoints panel. These strings can be used with any set of credentials that you generate.",
        "href": "/docs/databases-for-elasticsearch?topic=databases-for-elasticsearch-connection-strings&interface=cli"
      }
    ],
    "section_learn": {
      "developer": "https://developer.ibm.com/depmodels/cloud/",
      "architecture": "https://www.ibm.com/cloud/architecture",
      "training": "https://www.ibm.com/training/cloud",
      "community": "https://community.ibm.com/community/user/publiccloud/home"
    },
    "section_updates": {
      "view_more": "/docs/databases-for-elasticsearch?topic=databases-for-elasticsearch-elasticsearch-relnotes",
      "tiles": [
        {
          "date": "26 October 2023",
          "title": "Deploy Kibana using Code Engine and connect to your Databases for Elasticsearch instance",
          "description": "With this tutorial, deploy Kibana using Code Engine and connect to your Databases for Elasticsearch instance. Kibana is a web interface that allows you to visualise the data in Elasticsearch instances. Code Engine is a a fully managed, serverless platform that allows you to run workloads without worrying about deploying infrastructure. Elasticsearch is a NoSQL database with powerful search capabilities."
        },
        {
          "date": "12 October 2023",
          "title": "Databases for Elasticsearch v7.17 end of life",
          "description": "End of life announcement: Version 7.17 reaches end of life 26 April 2024. All Databases for Elasticsearch instances on deprecated versions that are still active will be upgraded in-place to the next major version. We recommend that you upgrade following our backup and restore process before the EOL date of your version."
        },
        {
          "date": "02 October 2023",
          "title": "Elasticsearch end of life for versions 7.9 and 7.10",
          "description": "Action is required before 30 November 2023 for your IBM Cloud速 Databases for Elasticsearch version 7.9 and 7.10 deployments. On November 30, these versions will be end of life. Our recommended procedure for this is restoring from a backup."
        }
      ]
    }
  }
